LIKAIMO/STM8_VL53L1X/Bsp/vl53l1x_reg.h
#ifndef _VL53L1_REGISTER_MAP_H_
#define _VL53L1_REGISTER_MAP_H_

/** @defgroup VL53L1_register_DefineRegisters_group Define Registers *  @brief List of all the defined registers
 *  @{
 */

#define VL53L1_SOFT_RESET 0x0000
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_I2C_SLAVE__DEVICE_ADDRESS 0x0001
/*!<
  type:     uint8_t \n
  default:  EWOK_I2C_DEV_ADDR_DEFAULT \n
  info: \n
    - msb =  6
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_nvm_managed', 'system_config']

  fields: \n
    - [6:0] = i2c_slave_device_address
*/
#define VL53L1_ANA_CONFIG__VHV_REF_SEL_VDDPIX 0x0002
/*!<
  type:     uint8_t \n
  default:  0x02 \n
  info: \n
    - msb =  3
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_nvm_managed', 'analog_config']

  fields: \n
    - [3:0] = ref_sel_vddpix
*/
#define VL53L1_ANA_CONFIG__VHV_REF_SEL_VQUENCH 0x0003
/*!<
  type:     uint8_t \n
  default:  0x10 \n
  info: \n
    - msb =  6
    - lsb =  3
    - i2c_size =  1

  groups: \n
    ['static_nvm_managed', 'analog_config']

  fields: \n
    - [6:3] = ref_sel_vquench
*/
#define VL53L1_ANA_CONFIG__REG_AVDD1V2_SEL 0x0004
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  1
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_nvm_managed', 'analog_config']

  fields: \n
    - [1:0] = reg_avdd1v2_sel
*/
#define VL53L1_ANA_CONFIG__FAST_OSC__TRIM 0x0005
/*!<
  type:     uint8_t \n
  default:  0x48 \n
  info: \n
    - msb =  6
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_nvm_managed', 'analog_config']

  fields: \n
    - [6:0] = fast_osc_trim
*/
#define VL53L1_OSC_MEASURED__FAST_OSC__FREQUENCY 0x0006
/*!<
  type:     uint16_t \n
  default:  OSC_FREQUENCY \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['static_nvm_managed', 'analog_config']

  fields: \n
    - [15:0] = osc_frequency (fixed point 4.12)
*/
#define VL53L1_OSC_MEASURED__FAST_OSC__FREQUENCY_HI 0x0006
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_OSC_MEASURED__FAST_OSC__FREQUENCY_LO 0x0007
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_VHV_CONFIG__TIMEOUT_MACROP_LOOP_BOUND 0x0008
/*!<
  type:     uint8_t \n
  default:  0x81 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_nvm_managed', 'vhv_config']

  fields: \n
    - [1:0] = vhv_timeout__macrop
    - [7:2] = vhv_loop_bound
*/
#define VL53L1_VHV_CONFIG__COUNT_THRESH 0x0009
/*!<
  type:     uint8_t \n
  default:  0x80 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_nvm_managed', 'vhv_config']

  fields: \n
    - [7:0] = vhv_count_thresh
*/
#define VL53L1_VHV_CONFIG__OFFSET 0x000A
/*!<
  type:     uint8_t \n
  default:  0x07 \n
  info: \n
    - msb =  5
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_nvm_managed', 'vhv_config']

  fields: \n
    - [5:0] = vhv_step_val
*/
#define VL53L1_VHV_CONFIG__INIT 0x000B
/*!<
  type:     uint8_t \n
  default:  0x20 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_nvm_managed', 'vhv_config']

  fields: \n
    -   [7] = vhv0_init_enable
    - [5:0] = vhv0_init_value
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_REF_0 0x000D
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['customer_nvm_managed', 'ref_spad_en']

  fields: \n
    - [7:0] = spad_enables_ref_0
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_REF_1 0x000E
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['customer_nvm_managed', 'ref_spad_en']

  fields: \n
    - [7:0] = spad_enables_ref_1
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_REF_2 0x000F
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['customer_nvm_managed', 'ref_spad_en']

  fields: \n
    - [7:0] = spad_enables_ref_2
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_REF_3 0x0010
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['customer_nvm_managed', 'ref_spad_en']

  fields: \n
    - [7:0] = spad_enables_ref_3
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_REF_4 0x0011
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['customer_nvm_managed', 'ref_spad_en']

  fields: \n
    - [7:0] = spad_enables_ref_4
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_REF_5 0x0012
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  3
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['customer_nvm_managed', 'ref_spad_en']

  fields: \n
    - [3:0] = spad_enables_ref_5
*/
#define VL53L1_GLOBAL_CONFIG__REF_EN_START_SELECT 0x0013
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['customer_nvm_managed', 'ref_spad_start']

  fields: \n
    - [7:0] = ref_en_start_select
*/
#define VL53L1_REF_SPAD_MAN__NUM_REQUESTED_REF_SPADS 0x0014
/*!<
  type:     uint8_t \n
  default:  0x2C \n
  info: \n
    - msb =  5
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['customer_nvm_managed', 'ref_spad_config']

  fields: \n
    - [5:0] = ref_spad_man__num_requested_ref_spad
*/
#define VL53L1_REF_SPAD_MAN__REF_LOCATION 0x0015
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  1
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['customer_nvm_managed', 'ref_spad_config']

  fields: \n
    - [1:0] = ref_spad_man__ref_location
*/
#define VL53L1_ALGO__CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS 0x0016
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['customer_nvm_managed', 'algo_config']

  fields: \n
    - [15:0] = crosstalk_compensation_plane_offset_kcps (fixed point 7.9)
*/
#define VL53L1_ALGO__CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS_HI 0x0016
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_ALGO__CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS_LO 0x0017
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_ALGO__CROSSTALK_COMPENSATION_X_PLANE_GRADIENT_KCPS 0x0018
/*!<
  type:     int16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['customer_nvm_managed', 'algo_config']

  fields: \n
    - [15:0] = crosstalk_compensation_x_plane_gradient_kcps (fixed point 5.11)
*/
#define VL53L1_ALGO__CROSSTALK_COMPENSATION_X_PLANE_GRADIENT_KCPS_HI 0x0018
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_ALGO__CROSSTALK_COMPENSATION_X_PLANE_GRADIENT_KCPS_LO 0x0019
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_ALGO__CROSSTALK_COMPENSATION_Y_PLANE_GRADIENT_KCPS 0x001A
/*!<
  type:     int16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['customer_nvm_managed', 'algo_config']

  fields: \n
    - [15:0] = crosstalk_compensation_y_plane_gradient_kcps (fixed point 5.11)
*/
#define VL53L1_ALGO__CROSSTALK_COMPENSATION_Y_PLANE_GRADIENT_KCPS_HI 0x001A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_ALGO__CROSSTALK_COMPENSATION_Y_PLANE_GRADIENT_KCPS_LO 0x001B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_REF_SPAD_CHAR__TOTAL_RATE_TARGET_MCPS 0x001C
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['customer_nvm_managed', 'ref_spad_char']

  fields: \n
    - [15:0] = ref_spad_char__total_rate_target_mcps (fixed point 9.7)
*/
#define VL53L1_REF_SPAD_CHAR__TOTAL_RATE_TARGET_MCPS_HI 0x001C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_REF_SPAD_CHAR__TOTAL_RATE_TARGET_MCPS_LO 0x001D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_ALGO__PART_TO_PART_RANGE_OFFSET_MM 0x001E
/*!<
  type:     int16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 12
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['customer_nvm_managed', 'algo_config']

  fields: \n
    - [12:0] = part_to_part_offset_mm (fixed point 11.2)
*/
#define VL53L1_ALGO__PART_TO_PART_RANGE_OFFSET_MM_HI 0x001E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_ALGO__PART_TO_PART_RANGE_OFFSET_MM_LO 0x001F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MM_CONFIG__INNER_OFFSET_MM 0x0020
/*!<
  type:     int16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['customer_nvm_managed', 'mm_config']

  fields: \n
    - [15:0] = mm_config__inner_offset_mm
*/
#define VL53L1_MM_CONFIG__INNER_OFFSET_MM_HI 0x0020
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MM_CONFIG__INNER_OFFSET_MM_LO 0x0021
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MM_CONFIG__OUTER_OFFSET_MM 0x0022
/*!<
  type:     int16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['customer_nvm_managed', 'mm_config']

  fields: \n
    - [15:0] = mm_config__outer_offset_mm
*/
#define VL53L1_MM_CONFIG__OUTER_OFFSET_MM_HI 0x0022
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MM_CONFIG__OUTER_OFFSET_MM_LO 0x0023
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_DSS_CONFIG__TARGET_TOTAL_RATE_MCPS 0x0024
/*!<
  type:     uint16_t \n
  default:  0x0380 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['static_config', 'dss_config']

  fields: \n
    - [15:0] = dss_config__target_total_rate_mcps (fixed point 9.7)
*/
#define VL53L1_DSS_CONFIG__TARGET_TOTAL_RATE_MCPS_HI 0x0024
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_DSS_CONFIG__TARGET_TOTAL_RATE_MCPS_LO 0x0025
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_DEBUG__CTRL 0x0026
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'debug_config']

  fields: \n
    -   [0] = enable_result_logging
*/
#define VL53L1_TEST_MODE__CTRL 0x0027
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  3
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'test_mode_config']

  fields: \n
    - [3:0] = test_mode__cmd
*/
#define VL53L1_CLK_GATING__CTRL 0x0028
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  3
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'clk_config']

  fields: \n
    -   [0] = clk_gate_en__mcu_bank
    -   [1] = clk_gate_en__mcu_patch_ctrl
    -   [2] = clk_gate_en__mcu_timers
    -   [3] = clk_gate_en__mcu_mult_div
*/
#define VL53L1_NVM_BIST__CTRL 0x0029
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  4
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'nvm_bist_config']

  fields: \n
    - [2:0] = nvm_bist__cmd
    -   [4] = nvm_bist__ctrl
*/
#define VL53L1_NVM_BIST__NUM_NVM_WORDS 0x002A
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  6
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'nvm_bist_config']

  fields: \n
    - [6:0] = nvm_bist__num_nvm_words
*/
#define VL53L1_NVM_BIST__START_ADDRESS 0x002B
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  6
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'nvm_bist_config']

  fields: \n
    - [6:0] = nvm_bist__start_address
*/
#define VL53L1_HOST_IF__STATUS 0x002C
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'system_status']

  fields: \n
    -   [0] = host_interface
*/
#define VL53L1_PAD_I2C_HV__CONFIG 0x002D
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'gpio_config']

  fields: \n
    -   [0] = pad_scl_sda__vmodeint_hv
    -   [1] = i2c_pad__test_hv
    -   [2] = pad_scl__fpen_hv
    - [4:3] = pad_scl__progdel_hv
    -   [5] = pad_sda__fpen_hv
    - [7:6] = pad_sda__progdel_hv
*/
#define VL53L1_PAD_I2C_HV__EXTSUP_CONFIG 0x002E
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'gpio_config']

  fields: \n
    -   [0] = pad_scl_sda__extsup_hv
*/
#define VL53L1_GPIO_HV_PAD__CTRL 0x002F
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  1
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'gpio_config']

  fields: \n
    -   [0] = gpio__extsup_hv
    -   [1] = gpio__vmodeint_hv
*/
#define VL53L1_GPIO_HV_MUX__CTRL 0x0030
/*!<
  type:     uint8_t \n
  default:  0x11 \n
  info: \n
    - msb =  4
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'gpio_config']

  fields: \n
    - [3:0] = gpio__mux_select_hv
    -   [4] = gpio__mux_active_high_hv
*/
#define VL53L1_GPIO__TIO_HV_STATUS 0x0031
/*!<
  type:     uint8_t \n
  default:  0x02 \n
  info: \n
    - msb =  1
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'gpio_config']

  fields: \n
    -   [0] = gpio__tio_hv
    -   [1] = fresh_out_of_reset
*/
#define VL53L1_GPIO__FIO_HV_STATUS 0x0032
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  1
    - lsb =  1
    - i2c_size =  1

  groups: \n
    ['static_config', 'gpio_config']

  fields: \n
    -   [1] = gpio__fio_hv
*/
#define VL53L1_ANA_CONFIG__SPAD_SEL_PSWIDTH 0x0033
/*!<
  type:     uint8_t \n
  default:  0x02 \n
  info: \n
    - msb =  2
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'analog_config']

  fields: \n
    - [2:0] = spad_sel_pswidth
*/
#define VL53L1_ANA_CONFIG__VCSEL_PULSE_WIDTH_OFFSET 0x0034
/*!<
  type:     uint8_t \n
  default:  0x08 \n
  info: \n
    - msb =  4
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'analog_config']

  fields: \n
    - [4:0] = vcsel_pulse_width_offset (fixed point 1.4)
*/
#define VL53L1_ANA_CONFIG__FAST_OSC__CONFIG_CTRL 0x0035
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'analog_config']

  fields: \n
    -   [0] = osc_config__latch_bypass
*/
#define VL53L1_SIGMA_ESTIMATOR__EFFECTIVE_PULSE_WIDTH_NS 0x0036
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'algo_config']

  fields: \n
    - [7:0] = sigma_estimator__eff_pulse_width
*/
#define VL53L1_SIGMA_ESTIMATOR__EFFECTIVE_AMBIENT_WIDTH_NS 0x0037
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'algo_config']

  fields: \n
    - [7:0] = sigma_estimator__eff_ambient_width
*/
#define VL53L1_SIGMA_ESTIMATOR__SIGMA_REF_MM 0x0038
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'algo_config']

  fields: \n
    - [7:0] = sigma_estimator__sigma_ref
*/
#define VL53L1_ALGO__CROSSTALK_COMPENSATION_VALID_HEIGHT_MM 0x0039
/*!<
  type:     uint8_t \n
  default:  0x14 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'algo_config']

  fields: \n
    - [7:0] = crosstalk_compensation_valid_height_mm
*/
#define VL53L1_SPARE_HOST_CONFIG__STATIC_CONFIG_SPARE_0 0x003A
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'algo_config']

  fields: \n
    - [7:0] = static_config_spare_0
*/
#define VL53L1_SPARE_HOST_CONFIG__STATIC_CONFIG_SPARE_1 0x003B
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'algo_config']

  fields: \n
    - [7:0] = static_config_spare_1
*/
#define VL53L1_ALGO__RANGE_IGNORE_THRESHOLD_MCPS 0x003C
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['static_config', 'algo_config']

  fields: \n
    - [15:0] = range_ignore_thresh_mcps (fixed point 3.13)
*/
#define VL53L1_ALGO__RANGE_IGNORE_THRESHOLD_MCPS_HI 0x003C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_ALGO__RANGE_IGNORE_THRESHOLD_MCPS_LO 0x003D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_ALGO__RANGE_IGNORE_VALID_HEIGHT_MM 0x003E
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'algo_config']

  fields: \n
    - [7:0] = range_ignore_height_mm
*/
#define VL53L1_ALGO__RANGE_MIN_CLIP 0x003F
/*!<
  type:     uint8_t \n
  default:  0x8D \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'algo_config']

  fields: \n
    -   [0] = algo__range_min_clip_enable
    - [7:1] = algo__range_min_clip_value_mm
*/
#define VL53L1_ALGO__CONSISTENCY_CHECK__TOLERANCE 0x0040
/*!<
  type:     uint8_t \n
  default:  0x08 \n
  info: \n
    - msb =  3
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'algo_config']

  fields: \n
    - [3:0] = consistency_check_tolerance (fixed point 1.3)
*/
#define VL53L1_SPARE_HOST_CONFIG__STATIC_CONFIG_SPARE_2 0x0041
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'algo_config']

  fields: \n
    - [7:0] = static_config_spare_2
*/
#define VL53L1_SD_CONFIG__RESET_STAGES_MSB 0x0042
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  3
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'sigmadelta_config']

  fields: \n
    - [3:0] = loop_init__clear_stage
*/
#define VL53L1_SD_CONFIG__RESET_STAGES_LSB 0x0043
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['static_config', 'sigmadelta_config']

  fields: \n
    - [7:4] = accum_reset__clear_stage
    - [3:0] = count_reset__clear_stage
*/
#define VL53L1_GPH_CONFIG__STREAM_COUNT_UPDATE_VALUE 0x0044
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['general_config', 'roi_config']

  fields: \n
    - [7:0] = stream_count_update_value
*/
#define VL53L1_GLOBAL_CONFIG__STREAM_DIVIDER 0x0045
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['general_config', 'roi_config']

  fields: \n
    - [7:0] = stream_count_internal_div
*/
#define VL53L1_SYSTEM__INTERRUPT_CONFIG_GPIO 0x0046
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['general_config', 'gph_config']

  fields: \n
    - [1:0] = int_mode_distance
    - [3:2] = int_mode_rate
    -   [4] = int_spare
    -   [5] = int_new_measure_ready
    -   [6] = int_no_target_en
    -   [7] = int_combined_mode
*/
#define VL53L1_CAL_CONFIG__VCSEL_START 0x0047
/*!<
  type:     uint8_t \n
  default:  0x0B \n
  info: \n
    - msb =  6
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['general_config', 'cal_config']

  fields: \n
    - [6:0] = cal_config__vcsel_start
*/
#define VL53L1_CAL_CONFIG__REPEAT_RATE 0x0048
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 11
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['general_config', 'cal_config']

  fields: \n
    - [11:0] = cal_config__repeat_rate
*/
#define VL53L1_CAL_CONFIG__REPEAT_RATE_HI 0x0048
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_CAL_CONFIG__REPEAT_RATE_LO 0x0049
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_GLOBAL_CONFIG__VCSEL_WIDTH 0x004A
/*!<
  type:     uint8_t \n
  default:  0x02 \n
  info: \n
    - msb =  6
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['general_config', 'global_config']

  fields: \n
    - [6:0] = global_config__vcsel_width
*/
#define VL53L1_PHASECAL_CONFIG__TIMEOUT_MACROP 0x004B
/*!<
  type:     uint8_t \n
  default:  0x04 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['general_config', 'phasecal_config']

  fields: \n
    - [7:0] = phasecal_config__timeout_macrop
*/
#define VL53L1_PHASECAL_CONFIG__TARGET 0x004C
/*!<
  type:     uint8_t \n
  default:  0x21 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['general_config', 'phasecal_config']

  fields: \n
    - [7:0] = algo_phasecal_lim
*/
#define VL53L1_PHASECAL_CONFIG__OVERRIDE 0x004D
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['general_config', 'phasecal_config']

  fields: \n
    -   [0] = phasecal_config__override
*/
#define VL53L1_DSS_CONFIG__ROI_MODE_CONTROL 0x004F
/*!<
  type:     uint8_t \n
  default:  0x01 \n
  info: \n
    - msb =  2
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['general_config', 'dss_config']

  fields: \n
    - [1:0] = dss_config__input_mode
    -   [2] = calculate_roi_enable
*/
#define VL53L1_SYSTEM__THRESH_RATE_HIGH 0x0050
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['general_config', 'gph_config']

  fields: \n
    - [15:0] = thresh_rate_high (fixed point 9.7)
*/
#define VL53L1_SYSTEM__THRESH_RATE_HIGH_HI 0x0050
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SYSTEM__THRESH_RATE_HIGH_LO 0x0051
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SYSTEM__THRESH_RATE_LOW 0x0052
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['general_config', 'gph_config']

  fields: \n
    - [15:0] = thresh_rate_low (fixed point 9.7)
*/
#define VL53L1_SYSTEM__THRESH_RATE_LOW_HI 0x0052
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SYSTEM__THRESH_RATE_LOW_LO 0x0053
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT 0x0054
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['general_config', 'dss_config']

  fields: \n
    - [15:0] = dss_config__manual_effective_spads_select
*/
#define VL53L1_DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT_HI 0x0054
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT_LO 0x0055
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_DSS_CONFIG__MANUAL_BLOCK_SELECT 0x0056
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['general_config', 'dss_config']

