LIKAIMO/STM8_VL53L1X/Bsp/vl53l1x_reg.h
  fields: \n
    - [15:0] = result__spare_0_sd1
*/
#define VL53L1_RESULT__SPARE_0_SD1_HI 0x00AC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_0_SD1_LO 0x00AD
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_1_SD1 0x00AE
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['system_results', 'results']

  fields: \n
    - [15:0] = result__spare_1_sd1
*/
#define VL53L1_RESULT__SPARE_1_SD1_HI 0x00AE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_1_SD1_LO 0x00AF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_2_SD1 0x00B0
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['system_results', 'results']

  fields: \n
    - [15:0] = result__spare_2_sd1
*/
#define VL53L1_RESULT__SPARE_2_SD1_HI 0x00B0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_2_SD1_LO 0x00B1
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_3_SD1 0x00B2
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['system_results', 'results']

  fields: \n
    - [7:0] = result__spare_3_sd1
*/
#define VL53L1_RESULT__THRESH_INFO 0x00B3
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['system_results', 'results']

  fields: \n
    - [3:0] = result__distance_int_info
    - [7:4] = result__rate_int_info
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0 0x00B4
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = result_core__ambient_window_events_sd0
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_3 0x00B4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_2 0x00B5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_1 0x00B6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_0 0x00B7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0 0x00B8
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = result_core__ranging_total_events_sd0
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_3 0x00B8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_2 0x00B9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_1 0x00BA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_0 0x00BB
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0 0x00BC
/*!<
  type:     int32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = result_core__signal_total_events_sd0
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_3 0x00BC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_2 0x00BD
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_1 0x00BE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_0 0x00BF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0 0x00C0
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = result_core__total_periods_elapsed_sd0
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_3 0x00C0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_2 0x00C1
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_1 0x00C2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_0 0x00C3
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1 0x00C4
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = result_core__ambient_window_events_sd1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_3 0x00C4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_2 0x00C5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_1 0x00C6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_0 0x00C7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1 0x00C8
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = result_core__ranging_total_events_sd1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_3 0x00C8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_2 0x00C9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_1 0x00CA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_0 0x00CB
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1 0x00CC
/*!<
  type:     int32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = result_core__signal_total_events_sd1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_3 0x00CC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_2 0x00CD
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_1 0x00CE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_0 0x00CF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1 0x00D0
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = result_core__total_periods_elapsed_sd1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_3 0x00D0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_2 0x00D1
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_1 0x00D2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_0 0x00D3
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SPARE_0 0x00D4
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['core_results', 'ranging_core_results']

  fields: \n
    - [7:0] = result_core__spare_0
*/
#define VL53L1_PHASECAL_RESULT__REFERENCE_PHASE 0x00D6
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['debug_results', 'phasecal_results']

  fields: \n
    - [15:0] = result_phasecal__reference_phase (fixed point 5.11)
*/
#define VL53L1_PHASECAL_RESULT__REFERENCE_PHASE_HI 0x00D6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PHASECAL_RESULT__REFERENCE_PHASE_LO 0x00D7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PHASECAL_RESULT__VCSEL_START 0x00D8
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  6
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'phasecal_results']

  fields: \n
    - [6:0] = result_phasecal__vcsel_start
*/
#define VL53L1_REF_SPAD_CHAR_RESULT__NUM_ACTUAL_REF_SPADS 0x00D9
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  5
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'ref_spad_status']

  fields: \n
    - [5:0] = ref_spad_char_result__num_actual_ref_spads
*/
#define VL53L1_REF_SPAD_CHAR_RESULT__REF_LOCATION 0x00DA
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  1
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'ref_spad_status']

  fields: \n
    - [1:0] = ref_spad_char_result__ref_location
*/
#define VL53L1_VHV_RESULT__COLDBOOT_STATUS 0x00DB
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'vhv_results']

  fields: \n
    -   [0] = vhv_result__coldboot_status
*/
#define VL53L1_VHV_RESULT__SEARCH_RESULT 0x00DC
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  5
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'vhv_results']

  fields: \n
    - [5:0] = cp_sel_result
*/
#define VL53L1_VHV_RESULT__LATEST_SETTING 0x00DD
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  5
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'vhv_results']

  fields: \n
    - [5:0] = cp_sel_latest_setting
*/
#define VL53L1_RESULT__OSC_CALIBRATE_VAL 0x00DE
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb =  9
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['debug_results', 'misc_results']

  fields: \n
    - [9:0] = osc_calibrate_val
*/
#define VL53L1_RESULT__OSC_CALIBRATE_VAL_HI 0x00DE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RESULT__OSC_CALIBRATE_VAL_LO 0x00DF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_ANA_CONFIG__POWERDOWN_GO1 0x00E0
/*!<
  type:     uint8_t \n
  default:  0x02 \n
  info: \n
    - msb =  1
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'analog_config']

  fields: \n
    -   [0] = go2_ref_bg_disable_avdd
    -   [1] = go2_regdvdd1v2_enable_avdd
*/
#define VL53L1_ANA_CONFIG__REF_BG_CTRL 0x00E1
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  1
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'analog_config']

  fields: \n
    -   [0] = go2_ref_overdrvbg_avdd
    -   [1] = go2_ref_forcebgison_avdd
*/
#define VL53L1_ANA_CONFIG__REGDVDD1V2_CTRL 0x00E2
/*!<
  type:     uint8_t \n
  default:  0x01 \n
  info: \n
    - msb =  3
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'analog_config']

  fields: \n
    -   [0] = go2_regdvdd1v2_sel_pulldown_avdd
    -   [1] = go2_regdvdd1v2_sel_boost_avdd
    - [3:2] = go2_regdvdd1v2_selv_avdd
*/
#define VL53L1_ANA_CONFIG__OSC_SLOW_CTRL 0x00E3
/*!<
  type:     uint8_t \n
  default:  0x02 \n
  info: \n
    - msb =  2
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'analog_config']

  fields: \n
    -   [0] = osc_slow_en
    -   [1] = osc_slow_op_en
    -   [2] = osc_slow_freq_sel
*/
#define VL53L1_TEST_MODE__STATUS 0x00E4
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'test_mode_status']

  fields: \n
    -   [0] = test_mode_status
*/
#define VL53L1_FIRMWARE__SYSTEM_STATUS 0x00E5
/*!<
  type:     uint8_t \n
  default:  0x02 \n
  info: \n
    - msb =  1
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'firmware_status']

  fields: \n
    -   [0] = firmware_bootup
    -   [1] = firmware_first_range
*/
#define VL53L1_FIRMWARE__MODE_STATUS 0x00E6
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'firmware_status']

  fields: \n
    - [7:0] = firmware_mode_status
*/
#define VL53L1_FIRMWARE__SECONDARY_MODE_STATUS 0x00E7
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'firmware_status']

  fields: \n
    - [7:0] = fw_secondary_mode_status
*/
#define VL53L1_FIRMWARE__CAL_REPEAT_RATE_COUNTER 0x00E8
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 11
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['debug_results', 'firmware_status']

  fields: \n
    - [11:0] = firmware_cal_repeat_rate
*/
#define VL53L1_FIRMWARE__CAL_REPEAT_RATE_COUNTER_HI 0x00E8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_FIRMWARE__CAL_REPEAT_RATE_COUNTER_LO 0x00E9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_FIRMWARE__HISTOGRAM_BIN 0x00EA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__THRESH_HIGH 0x00EC
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    - [15:0] = shadow_thresh_high
*/
#define VL53L1_GPH__SYSTEM__THRESH_HIGH_HI 0x00EC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__THRESH_HIGH_LO 0x00ED
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__THRESH_LOW 0x00EE
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    - [15:0] = shadow_thresh_low
*/
#define VL53L1_GPH__SYSTEM__THRESH_LOW_HI 0x00EE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__THRESH_LOW_LO 0x00EF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__ENABLE_XTALK_PER_QUADRANT 0x00F0
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    -   [0] = shadow__enable_xtalk_per_quadrant
*/
#define VL53L1_GPH__SPARE_0 0x00F1
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  2
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    -   [0] = fw_safe_to_disable
    -   [1] = shadow__spare_0
    -   [2] = shadow__spare_1
*/
#define VL53L1_GPH__SD_CONFIG__WOI_SD0 0x00F2
/*!<
  type:     uint8_t \n
  default:  0x04 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    - [7:0] = shadow_sd_config__woi_sd0
*/
#define VL53L1_GPH__SD_CONFIG__WOI_SD1 0x00F3
/*!<
  type:     uint8_t \n
  default:  0x04 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    - [7:0] = shadow_sd_config__woi_sd1
*/
#define VL53L1_GPH__SD_CONFIG__INITIAL_PHASE_SD0 0x00F4
/*!<
  type:     uint8_t \n
  default:  0x03 \n
  info: \n
    - msb =  6
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    - [6:0] = shadow_sd_config__initial_phase_sd0
*/
#define VL53L1_GPH__SD_CONFIG__INITIAL_PHASE_SD1 0x00F5
/*!<
  type:     uint8_t \n
  default:  0x03 \n
  info: \n
    - msb =  6
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    - [6:0] = shadow_sd_config__initial_phase_sd1
*/
#define VL53L1_GPH__SD_CONFIG__FIRST_ORDER_SELECT 0x00F6
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  1
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    -   [0] = shadow_sd_config__first_order_select_rtn
    -   [1] = shadow_sd_config__first_order_select_ref
*/
#define VL53L1_GPH__SD_CONFIG__QUANTIFIER 0x00F7
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  3
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    - [3:0] = shadow_sd_config__quantifier
*/
#define VL53L1_GPH__ROI_CONFIG__USER_ROI_CENTRE_SPAD 0x00F8
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    - [7:0] = shadow_user_roi_center_spad_q0
*/
#define VL53L1_GPH__ROI_CONFIG__USER_ROI_REQUESTED_GLOBAL_XY_SIZE 0x00F9
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    - [7:0] = shadow_user_roi_requested_global_xy_size
*/
#define VL53L1_GPH__SYSTEM__SEQUENCE_CONFIG 0x00FA
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    -   [0] = shadow_sequence_vhv_en
    -   [1] = shadow_sequence_phasecal_en
    -   [2] = shadow_sequence_reference_phase_en
    -   [3] = shadow_sequence_dss1_en
    -   [4] = shadow_sequence_dss2_en
    -   [5] = shadow_sequence_mm1_en
    -   [6] = shadow_sequence_mm2_en
    -   [7] = shadow_sequence_range_en
*/
#define VL53L1_GPH__GPH_ID 0x00FB
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'gph_actual']

  fields: \n
    -   [0] = shadow_gph_id
*/
#define VL53L1_SYSTEM__INTERRUPT_SET 0x00FC
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  1
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'system_int_set']

  fields: \n
    -   [0] = sys_interrupt_set_range
    -   [1] = sys_interrupt_set_error
*/
#define VL53L1_INTERRUPT_MANAGER__ENABLES 0x00FD
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  4
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'interrupt_manager']

  fields: \n
    -   [0] = interrupt_enable__single_shot
    -   [1] = interrupt_enable__back_to_back
    -   [2] = interrupt_enable__timed
    -   [3] = interrupt_enable__abort
    -   [4] = interrupt_enable__test
*/
#define VL53L1_INTERRUPT_MANAGER__CLEAR 0x00FE
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  4
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'interrupt_manager']

  fields: \n
    -   [0] = interrupt_clear__single_shot
    -   [1] = interrupt_clear__back_to_back
    -   [2] = interrupt_clear__timed
    -   [3] = interrupt_clear__abort
    -   [4] = interrupt_clear__test
*/
#define VL53L1_INTERRUPT_MANAGER__STATUS 0x00FF
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  4
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'interrupt_manager']

  fields: \n
    -   [0] = interrupt_status__single_shot
    -   [1] = interrupt_status__back_to_back
    -   [2] = interrupt_status__timed
    -   [3] = interrupt_status__abort
    -   [4] = interrupt_status__test
*/
#define VL53L1_MCU_TO_HOST_BANK__WR_ACCESS_EN 0x0100
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'host_bank_ctrl']

  fields: \n
    -   [0] = mcu_to_host_bank_wr_en
*/
#define VL53L1_POWER_MANAGEMENT__GO1_RESET_STATUS 0x0101
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'power_man_status']

  fields: \n
    -   [0] = go1_status
*/
#define VL53L1_PAD_STARTUP_MODE__VALUE_RO 0x0102
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  1
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'pad_config']

  fields: \n
    -   [0] = pad_atest1_val_ro
    -   [1] = pad_atest2_val_ro
*/
#define VL53L1_PAD_STARTUP_MODE__VALUE_CTRL 0x0103
/*!<
  type:     uint8_t \n
  default:  0x30 \n
  info: \n
    - msb =  5
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'pad_config']

  fields: \n
    -   [0] = pad_atest1_val
    -   [1] = pad_atest2_val
    -   [4] = pad_atest1_dig_enable
    -   [5] = pad_atest2_dig_enable
*/
#define VL53L1_PLL_PERIOD_US 0x0104
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 17
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['debug_results', 'pll_config']

  fields: \n
    - [17:0] = pll_period_us (fixed point 0.24)
*/
#define VL53L1_PLL_PERIOD_US_3 0x0104
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PLL_PERIOD_US_2 0x0105
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PLL_PERIOD_US_1 0x0106
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PLL_PERIOD_US_0 0x0107
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT 0x0108
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['debug_results', 'debug_timer']

  fields: \n
    - [31:0] = interrupt_scheduler_data_out
*/
#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT_3 0x0108
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT_2 0x0109
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT_1 0x010A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT_0 0x010B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_NVM_BIST__COMPLETE 0x010C
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'nvm_bist_status']

  fields: \n
    -   [0] = nvm_bist__complete
*/
#define VL53L1_NVM_BIST__STATUS 0x010D
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['debug_results', 'nvm_bist_status']

  fields: \n
    -   [0] = nvm_bist__status
*/
#define VL53L1_IDENTIFICATION__MODEL_ID 0x010F
/*!<
  type:     uint8_t \n
  default:  0xEA \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

