LIKAIMO/STM8_VL53L1X/Bsp/vl53l1x_reg.h
  groups: \n
    ['nvm_copy_data', 'identification']

  fields: \n
    - [7:0] = model_id
*/
#define VL53L1_IDENTIFICATION__MODULE_TYPE 0x0110
/*!<
  type:     uint8_t \n
  default:  0xAA \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'identification']

  fields: \n
    - [7:0] = module_type
*/
#define VL53L1_IDENTIFICATION__REVISION_ID 0x0111
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'identification']

  fields: \n
    - [3:0] = nvm_revision_id
    - [7:4] = mask_revision_id
*/
#define VL53L1_IDENTIFICATION__MODULE_ID 0x0112
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['nvm_copy_data', 'identification']

  fields: \n
    - [15:0] = module_id
*/
#define VL53L1_IDENTIFICATION__MODULE_ID_HI 0x0112
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_IDENTIFICATION__MODULE_ID_LO 0x0113
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_ANA_CONFIG__FAST_OSC__TRIM_MAX 0x0114
/*!<
  type:     uint8_t \n
  default:  OSC_TRIM_DEFAULT \n
  info: \n
    - msb =  6
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'analog_config']

  fields: \n
    - [6:0] = osc_trim_max
*/
#define VL53L1_ANA_CONFIG__FAST_OSC__FREQ_SET 0x0115
/*!<
  type:     uint8_t \n
  default:  OSC_FREQ_SET_DEFAULT \n
  info: \n
    - msb =  2
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'analog_config']

  fields: \n
    - [2:0] = osc_freq_set
*/
#define VL53L1_ANA_CONFIG__VCSEL_TRIM 0x0116
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  2
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'analog_config']

  fields: \n
    - [2:0] = vcsel_trim
*/
#define VL53L1_ANA_CONFIG__VCSEL_SELION 0x0117
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  5
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'analog_config']

  fields: \n
    - [5:0] = vcsel_selion
*/
#define VL53L1_ANA_CONFIG__VCSEL_SELION_MAX 0x0118
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  5
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'analog_config']

  fields: \n
    - [5:0] = vcsel_selion_max
*/
#define VL53L1_PROTECTED_LASER_SAFETY__LOCK_BIT 0x0119
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'laser_safety']

  fields: \n
    -   [0] = laser_safety__lock_bit
*/
#define VL53L1_LASER_SAFETY__KEY 0x011A
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  6
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'laser_safety']

  fields: \n
    - [6:0] = laser_safety__key
*/
#define VL53L1_LASER_SAFETY__KEY_RO 0x011B
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'laser_safety']

  fields: \n
    -   [0] = laser_safety__key_ro
*/
#define VL53L1_LASER_SAFETY__CLIP 0x011C
/*!<
  type:     uint8_t \n
  default:  0x02 \n
  info: \n
    - msb =  5
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'laser_safety']

  fields: \n
    - [5:0] = vcsel_pulse_width_clip
*/
#define VL53L1_LASER_SAFETY__MULT 0x011D
/*!<
  type:     uint8_t \n
  default:  0x32 \n
  info: \n
    - msb =  5
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'laser_safety']

  fields: \n
    - [5:0] = vcsel_pulse_width_mult
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_0 0x011E
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_0
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_1 0x011F
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_1
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_2 0x0120
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_2
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_3 0x0121
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_3
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_4 0x0122
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_4
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_5 0x0123
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_5
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_6 0x0124
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_6
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_7 0x0125
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_7
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_8 0x0126
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_8
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_9 0x0127
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_9
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_10 0x0128
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_10
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_11 0x0129
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_11
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_12 0x012A
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_12
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_13 0x012B
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_13
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_14 0x012C
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_14
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_15 0x012D
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_15
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_16 0x012E
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_16
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_17 0x012F
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_17
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_18 0x0130
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_18
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_19 0x0131
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_19
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_20 0x0132
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_20
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_21 0x0133
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_21
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_22 0x0134
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_22
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_23 0x0135
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_23
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_24 0x0136
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_24
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_25 0x0137
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_25
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_26 0x0138
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_26
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_27 0x0139
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_27
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_28 0x013A
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_28
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_29 0x013B
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_29
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_30 0x013C
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_30
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_31 0x013D
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'ret_spad_config']

  fields: \n
    - [7:0] = spad_enables_rtn_31
*/
#define VL53L1_ROI_CONFIG__MODE_ROI_CENTRE_SPAD 0x013E
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'roi_config']

  fields: \n
    - [7:0] = mode_roi_center_spad
*/
#define VL53L1_ROI_CONFIG__MODE_ROI_XY_SIZE 0x013F
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['nvm_copy_data', 'roi_config']

  fields: \n
    - [7:0] = mode_roi_xy_size
*/
#define VL53L1_GO2_HOST_BANK_ACCESS__OVERRIDE 0x0300
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLICAND 0x0400
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLICAND_3 0x0400
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLICAND_2 0x0401
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLICAND_1 0x0402
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLICAND_0 0x0403
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLIER 0x0404
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLIER_3 0x0404
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLIER_2 0x0405
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLIER_1 0x0406
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLIER_0 0x0407
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_HI 0x0408
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_HI_3 0x0408
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_HI_2 0x0409
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_HI_1 0x040A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_HI_0 0x040B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_LO 0x040C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_LO_3 0x040C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_LO_2 0x040D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_LO_1 0x040E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_LO_0 0x040F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__START 0x0410
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_MULTIPLIER__STATUS 0x0411
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__START 0x0412
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__STATUS 0x0413
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__DIVIDEND 0x0414
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__DIVIDEND_3 0x0414
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__DIVIDEND_2 0x0415
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__DIVIDEND_1 0x0416
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__DIVIDEND_0 0x0417
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__DIVISOR 0x0418
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__DIVISOR_3 0x0418
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__DIVISOR_2 0x0419
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__DIVISOR_1 0x041A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__DIVISOR_0 0x041B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__QUOTIENT 0x041C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__QUOTIENT_3 0x041C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__QUOTIENT_2 0x041D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__QUOTIENT_1 0x041E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_UTIL_DIVIDER__QUOTIENT_0 0x041F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_TIMER0__VALUE_IN 0x0420
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_TIMER0__VALUE_IN_3 0x0420
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_TIMER0__VALUE_IN_2 0x0421
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_TIMER0__VALUE_IN_1 0x0422
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_TIMER0__VALUE_IN_0 0x0423
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_TIMER1__VALUE_IN 0x0424
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_TIMER1__VALUE_IN_3 0x0424
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_TIMER1__VALUE_IN_2 0x0425
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_TIMER1__VALUE_IN_1 0x0426
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_TIMER1__VALUE_IN_0 0x0427
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_TIMER0__CTRL 0x0428
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_TIMER1__CTRL 0x0429
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_GENERAL_PURPOSE__GP_0 0x042C
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = mcu_gp_0
*/
#define VL53L1_MCU_GENERAL_PURPOSE__GP_1 0x042D
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = mcu_gp_1
*/
#define VL53L1_MCU_GENERAL_PURPOSE__GP_2 0x042E
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = mcu_gp_2
*/
#define VL53L1_MCU_GENERAL_PURPOSE__GP_3 0x042F
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = mcu_gp_3
*/
#define VL53L1_MCU_RANGE_CALC__CONFIG 0x0430
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    -   [0] = fw_calc__sigma_delta_sel
    -   [2] = fw_calc__phase_output_en
    -   [3] = fw_calc__peak_signal_rate_en
    -   [4] = fw_calc__ambient_rate_en
    -   [5] = fw_calc__total_rate_per_spad_en
    -   [6] = fw_calc__snr_avg_signal_rate_en
    -   [7] = fw_calc__sigma_en
*/
#define VL53L1_MCU_RANGE_CALC__OFFSET_CORRECTED_RANGE 0x0432
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['']

  fields: \n
    - [15:0] = offset_corrected_range
*/
#define VL53L1_MCU_RANGE_CALC__OFFSET_CORRECTED_RANGE_HI 0x0432
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__OFFSET_CORRECTED_RANGE_LO 0x0433
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_4 0x0434
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 16
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['']

  fields: \n
    - [16:0] = mcu_calc__spare_4
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_4_3 0x0434
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_4_2 0x0435
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_4_1 0x0436
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_4_0 0x0437
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__AMBIENT_DURATION_PRE_CALC 0x0438
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 13
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['']

  fields: \n
    - [13:0] = ambient_duration_prec_calc
*/
#define VL53L1_MCU_RANGE_CALC__AMBIENT_DURATION_PRE_CALC_HI 0x0438
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__AMBIENT_DURATION_PRE_CALC_LO 0x0439
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_VCSEL_PERIOD 0x043C
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = algo_vcsel_period
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_5 0x043D
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = mcu_calc__spare_5
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_TOTAL_PERIODS 0x043E
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['']

  fields: \n
    - [15:0] = algo_total_periods
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_TOTAL_PERIODS_HI 0x043E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_TOTAL_PERIODS_LO 0x043F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_ACCUM_PHASE 0x0440
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['']

