LIKAIMO/STM8_VL53L1X/Bsp/vl53l1x_reg.h
  fields: \n
    - [31:0] = algo_accum_phase
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_ACCUM_PHASE_3 0x0440
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_ACCUM_PHASE_2 0x0441
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_ACCUM_PHASE_1 0x0442
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_ACCUM_PHASE_0 0x0443
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS 0x0444
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['']

  fields: \n
    - [31:0] = algo_signal_events
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS_3 0x0444
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS_2 0x0445
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS_1 0x0446
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS_0 0x0447
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS 0x0448
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['']

  fields: \n
    - [31:0] = algo_ambient_events
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS_3 0x0448
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS_2 0x0449
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS_1 0x044A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS_0 0x044B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_6 0x044C
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['']

  fields: \n
    - [15:0] = mcu_calc__spare_6
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_6_HI 0x044C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_6_LO 0x044D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_ADJUST_VCSEL_PERIOD 0x044E
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['']

  fields: \n
    - [15:0] = algo_adjust_vcsel_period
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_ADJUST_VCSEL_PERIOD_HI 0x044E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__ALGO_ADJUST_VCSEL_PERIOD_LO 0x044F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__NUM_SPADS 0x0450
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['']

  fields: \n
    - [15:0] = num_spads
*/
#define VL53L1_MCU_RANGE_CALC__NUM_SPADS_HI 0x0450
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__NUM_SPADS_LO 0x0451
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__PHASE_OUTPUT 0x0452
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['']

  fields: \n
    - [15:0] = phase_output
*/
#define VL53L1_MCU_RANGE_CALC__PHASE_OUTPUT_HI 0x0452
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__PHASE_OUTPUT_LO 0x0453
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS 0x0454
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 19
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['']

  fields: \n
    - [19:0] = rate_per_spad_mcps
*/
#define VL53L1_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS_3 0x0454
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS_2 0x0455
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS_1 0x0456
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS_0 0x0457
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_7 0x0458
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = mcu_calc__spare_7
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_8 0x0459
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = mcu_calc__spare_8
*/
#define VL53L1_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_MCPS 0x045A
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['']

  fields: \n
    - [15:0] = peak_signal_rate
*/
#define VL53L1_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_MCPS_HI 0x045A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_MCPS_LO 0x045B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__AVG_SIGNAL_RATE_MCPS 0x045C
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['']

  fields: \n
    - [15:0] = avg_signal_rate
*/
#define VL53L1_MCU_RANGE_CALC__AVG_SIGNAL_RATE_MCPS_HI 0x045C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__AVG_SIGNAL_RATE_MCPS_LO 0x045D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__AMBIENT_RATE_MCPS 0x045E
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['']

  fields: \n
    - [15:0] = ambient_rate
*/
#define VL53L1_MCU_RANGE_CALC__AMBIENT_RATE_MCPS_HI 0x045E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__AMBIENT_RATE_MCPS_LO 0x045F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__XTALK 0x0460
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['']

  fields: \n
    - [15:0] = crosstalk (fixed point 9.7)
*/
#define VL53L1_MCU_RANGE_CALC__XTALK_HI 0x0460
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__XTALK_LO 0x0461
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__CALC_STATUS 0x0462
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = calc_status
*/
#define VL53L1_MCU_RANGE_CALC__DEBUG 0x0463
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    -   [0] = calc_debug__divide_by_zero
*/
#define VL53L1_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_XTALK_CORR_MCPS 0x0464
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['']

  fields: \n
    - [15:0] = peak_signal_rate_xtalk_corr
*/
#define VL53L1_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_XTALK_CORR_MCPS_HI 0x0464
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_XTALK_CORR_MCPS_LO 0x0465
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_0 0x0468
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = mcu_calc__spare_0
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_1 0x0469
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = mcu_calc__spare_1
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_2 0x046A
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = mcu_calc__spare_2
*/
#define VL53L1_MCU_RANGE_CALC__SPARE_3 0x046B
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [7:0] = mcu_calc__spare_3
*/
#define VL53L1_PATCH__CTRL 0x0470
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__JMP_ENABLES 0x0472
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__JMP_ENABLES_HI 0x0472
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__JMP_ENABLES_LO 0x0473
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__DATA_ENABLES 0x0474
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__DATA_ENABLES_HI 0x0474
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__DATA_ENABLES_LO 0x0475
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_0 0x0476
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_0_HI 0x0476
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_0_LO 0x0477
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_1 0x0478
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_1_HI 0x0478
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_1_LO 0x0479
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_2 0x047A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_2_HI 0x047A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_2_LO 0x047B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_3 0x047C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_3_HI 0x047C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_3_LO 0x047D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_4 0x047E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_4_HI 0x047E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_4_LO 0x047F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_5 0x0480
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_5_HI 0x0480
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_5_LO 0x0481
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_6 0x0482
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_6_HI 0x0482
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_6_LO 0x0483
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_7 0x0484
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_7_HI 0x0484
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_7_LO 0x0485
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_8 0x0486
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_8_HI 0x0486
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_8_LO 0x0487
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_9 0x0488
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_9_HI 0x0488
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_9_LO 0x0489
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_10 0x048A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_10_HI 0x048A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_10_LO 0x048B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_11 0x048C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_11_HI 0x048C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_11_LO 0x048D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_12 0x048E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_12_HI 0x048E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_12_LO 0x048F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_13 0x0490
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_13_HI 0x0490
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_13_LO 0x0491
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_14 0x0492
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_14_HI 0x0492
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_14_LO 0x0493
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_15 0x0494
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_15_HI 0x0494
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__OFFSET_15_LO 0x0495
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_0 0x0496
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_0_HI 0x0496
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_0_LO 0x0497
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_1 0x0498
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_1_HI 0x0498
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_1_LO 0x0499
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_2 0x049A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_2_HI 0x049A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_2_LO 0x049B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_3 0x049C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_3_HI 0x049C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_3_LO 0x049D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_4 0x049E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_4_HI 0x049E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_4_LO 0x049F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_5 0x04A0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_5_HI 0x04A0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_5_LO 0x04A1
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_6 0x04A2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_6_HI 0x04A2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_6_LO 0x04A3
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_7 0x04A4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_7_HI 0x04A4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_7_LO 0x04A5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_8 0x04A6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_8_HI 0x04A6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_8_LO 0x04A7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_9 0x04A8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_9_HI 0x04A8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_9_LO 0x04A9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_10 0x04AA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_10_HI 0x04AA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_10_LO 0x04AB
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_11 0x04AC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_11_HI 0x04AC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_11_LO 0x04AD
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_12 0x04AE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_12_HI 0x04AE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_12_LO 0x04AF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_13 0x04B0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_13_HI 0x04B0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_13_LO 0x04B1
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_14 0x04B2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_14_HI 0x04B2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_14_LO 0x04B3
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_15 0x04B4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_15_HI 0x04B4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PATCH__ADDRESS_15_LO 0x04B5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SPI_ASYNC_MUX__CTRL 0x04C0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_CLK__CONFIG 0x04C4
/*!<
  type:     uint8_t \n
  default:  0x01 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    -   [0] = clk_mcu_en
*/
#define VL53L1_GPIO_LV_MUX__CTRL 0x04CC
/*!<
  type:     uint8_t \n
  default:  0x08 \n
  info: \n
    - msb =  4
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    - [3:0] = gpio__mux_select_lv
    -   [4] = gpio__mux_active_high_lv
*/
#define VL53L1_GPIO_LV_PAD__CTRL 0x04CD
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    -   [0] = gpio__extsup_lv
*/
#define VL53L1_PAD_I2C_LV__CONFIG 0x04D0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PAD_STARTUP_MODE__VALUE_RO_GO1 0x04D4
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    -   [0] = pad_spi_csn_val_ro
*/
#define VL53L1_HOST_IF__STATUS_GO1 0x04D5
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

  fields: \n
    -   [0] = host_interface_lv
*/
#define VL53L1_MCU_CLK_GATING__CTRL 0x04D8
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  3
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['']

