LIKAIMO/STM8_VL53L1X/Bsp/vl53l1x_reg.h
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__WINDOW_SETTING__A0 0x0A0E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__VCSEL_DELAY__A0 0x0A1A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REFERENCE_2__A0 0x0A1B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REGAVDD1V2__A0 0x0A1D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__TST_MUX__A0 0x0A1F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__CUSTOM_FE_2__A0 0x0A20
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SPAD_READOUT__A0 0x0A21
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__CPUMP_1__A0 0x0A22
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SPARE_REGISTER__A0 0x0A23
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__VCSEL_CONT_STAGE5_BYPASS__A0 0x0A24
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_18 0x0A25
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_19 0x0A26
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_20 0x0A27
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_21 0x0A28
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_22 0x0A29
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_23 0x0A2A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_24 0x0A2B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_25 0x0A2C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_26 0x0A2D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_27 0x0A2E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_28 0x0A2F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_29 0x0A30
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_30 0x0A31
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_31 0x0A32
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REF_SPAD_EN_0__EWOK 0x0A33
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REF_SPAD_EN_1__EWOK 0x0A34
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REF_SPAD_EN_2__EWOK 0x0A35
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REF_SPAD_EN_3__EWOK 0x0A36
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REF_SPAD_EN_4__EWOK 0x0A37
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REF_SPAD_EN_5__EWOK 0x0A38
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REF_EN_START_SELECT 0x0A39
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REGDVDD1V2_ATEST__EWOK 0x0A41
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SOFT_RESET_GO1 0x0B00
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PRIVATE__PATCH_BASE_ADDR_RSLV 0x0E00
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__INTERRUPT_STATUS 0x0ED0
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  5
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [2:0] = prev_shadow_int_status
    - [4:3] = prev_shadow_int_error_status
    -   [5] = prev_shadow_gph_id_gpio_status
*/
#define VL53L1_PREV_SHADOW_RESULT__RANGE_STATUS 0x0ED1
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [4:0] = prev_shadow_range_status
    -   [5] = prev_shadow_max_threshold_hit
    -   [6] = prev_shadow_min_threshold_hit
    -   [7] = prev_shadow_gph_id_range_status
*/
#define VL53L1_PREV_SHADOW_RESULT__REPORT_STATUS 0x0ED2
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  3
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [3:0] = prev_shadow_report_status
*/
#define VL53L1_PREV_SHADOW_RESULT__STREAM_COUNT 0x0ED3
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [7:0] = prev_shadow_result__stream_count
*/
#define VL53L1_PREV_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0 0x0ED4
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__dss_actual_effective_spads_sd0 (fixed point 8.8)
*/
#define VL53L1_PREV_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x0ED4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x0ED5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0 0x0ED6
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__peak_signal_count_rate_mcps_sd0 (fixed point 9.7)
*/
#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_HI 0x0ED6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_LO 0x0ED7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0 0x0ED8
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__ambient_count_rate_mcps_sd0 (fixed point 9.7)
*/
#define VL53L1_PREV_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0_HI 0x0ED8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0_LO 0x0ED9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SIGMA_SD0 0x0EDA
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__sigma_sd0 (fixed point 14.2)
*/
#define VL53L1_PREV_SHADOW_RESULT__SIGMA_SD0_HI 0x0EDA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SIGMA_SD0_LO 0x0EDB
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__PHASE_SD0 0x0EDC
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__phase_sd0 (fixed point 5.11)
*/
#define VL53L1_PREV_SHADOW_RESULT__PHASE_SD0_HI 0x0EDC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__PHASE_SD0_LO 0x0EDD
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0 0x0EDE
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__final_crosstalk_corrected_range_mm_sd0
*/
#define VL53L1_PREV_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_HI 0x0EDE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_LO 0x0EDF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0 0x0EE0
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__peak_signal_count_rate_crosstalk_corrected_mcps_sd0 (fixed point 9.7)
*/
#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_HI 0x0EE0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_LO 0x0EE1
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0 0x0EE2
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__mm_inner_actual_effective_spads_sd0 (fixed point 8.8)
*/
#define VL53L1_PREV_SHADOW_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x0EE2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x0EE3
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0 0x0EE4
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__mm_outer_actual_effective_spads_sd0 (fixed point 8.8)
*/
#define VL53L1_PREV_SHADOW_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x0EE4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x0EE5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0 0x0EE6
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__avg_signal_count_rate_mcps_sd0 (fixed point 9.7)
*/
#define VL53L1_PREV_SHADOW_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0_HI 0x0EE6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0_LO 0x0EE7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1 0x0EE8
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__dss_actual_effective_spads_sd1 (fixed point 8.8)
*/
#define VL53L1_PREV_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1_HI 0x0EE8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1_LO 0x0EE9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1 0x0EEA
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__peak_signal_count_rate_mcps_sd1 (fixed point 9.7)
*/
#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_HI 0x0EEA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_LO 0x0EEB
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1 0x0EEC
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__ambient_count_rate_mcps_sd1 (fixed point 9.7)
*/
#define VL53L1_PREV_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1_HI 0x0EEC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1_LO 0x0EED
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SIGMA_SD1 0x0EEE
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__sigma_sd1 (fixed point 14.2)
*/
#define VL53L1_PREV_SHADOW_RESULT__SIGMA_SD1_HI 0x0EEE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SIGMA_SD1_LO 0x0EEF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__PHASE_SD1 0x0EF0
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__phase_sd1 (fixed point 5.11)
*/
#define VL53L1_PREV_SHADOW_RESULT__PHASE_SD1_HI 0x0EF0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__PHASE_SD1_LO 0x0EF1
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1 0x0EF2
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__final_crosstalk_corrected_range_mm_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_HI 0x0EF2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_LO 0x0EF3
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_0_SD1 0x0EF4
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__spare_0_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_0_SD1_HI 0x0EF4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_0_SD1_LO 0x0EF5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_1_SD1 0x0EF6
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__spare_1_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_1_SD1_HI 0x0EF6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_1_SD1_LO 0x0EF7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_2_SD1 0x0EF8
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__spare_2_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_2_SD1_HI 0x0EF8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_2_SD1_LO 0x0EF9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_3_SD1 0x0EFA
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['prev_shadow_system_results', 'results']

  fields: \n
    - [15:0] = prev_shadow_result__spare_3_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_3_SD1_HI 0x0EFA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_3_SD1_LO 0x0EFB
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0 0x0EFC
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['prev_shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = prev_shadow_result_core__ambient_window_events_sd0
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_3 0x0EFC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_2 0x0EFD
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_1 0x0EFE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_0 0x0EFF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0 0x0F00
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['prev_shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = prev_shadow_result_core__ranging_total_events_sd0
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_3 0x0F00
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_2 0x0F01
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_1 0x0F02
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_0 0x0F03
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0 0x0F04
/*!<
  type:     int32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['prev_shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = prev_shadow_result_core__signal_total_events_sd0
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_3 0x0F04
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_2 0x0F05
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_1 0x0F06
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_0 0x0F07
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0 0x0F08
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['prev_shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = prev_shadow_result_core__total_periods_elapsed_sd0
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_3 0x0F08
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_2 0x0F09
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_1 0x0F0A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_0 0x0F0B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1 0x0F0C
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['prev_shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = prev_shadow_result_core__ambient_window_events_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_3 0x0F0C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_2 0x0F0D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_1 0x0F0E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_0 0x0F0F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1 0x0F10
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['prev_shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = prev_shadow_result_core__ranging_total_events_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_3 0x0F10
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_2 0x0F11
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_1 0x0F12
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_0 0x0F13
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1 0x0F14
/*!<
  type:     int32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['prev_shadow_core_results', 'ranging_core_results']

