LIKAIMO/STM8_VL53L1X/Bsp/vl53l1x_reg.h
  fields: \n
    - [31:0] = vhv_result__signal_total_events_ref
*/
#define VL53L1_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF_3 0x0F84
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF_2 0x0F85
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF_1 0x0F86
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF_0 0x0F87
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PHASECAL_RESULT__PHASE_OUTPUT_REF 0x0F88
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['patch_results', 'phasecal_results']

  fields: \n
    - [15:0] = phasecal_result__normalised_phase_ref
*/
#define VL53L1_PHASECAL_RESULT__PHASE_OUTPUT_REF_HI 0x0F88
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_PHASECAL_RESULT__PHASE_OUTPUT_REF_LO 0x0F89
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_DSS_RESULT__TOTAL_RATE_PER_SPAD 0x0F8A
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['patch_results', 'dss_results']

  fields: \n
    - [15:0] = dss_result__total_rate_per_spad
*/
#define VL53L1_DSS_RESULT__TOTAL_RATE_PER_SPAD_HI 0x0F8A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_DSS_RESULT__TOTAL_RATE_PER_SPAD_LO 0x0F8B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_DSS_RESULT__ENABLED_BLOCKS 0x0F8C
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['patch_results', 'dss_results']

  fields: \n
    - [7:0] = dss_result__enabled_blocks
*/
#define VL53L1_DSS_RESULT__NUM_REQUESTED_SPADS 0x0F8E
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['patch_results', 'dss_results']

  fields: \n
    - [15:0] = dss_result__num_requested_spads (fixed point 8.8)
*/
#define VL53L1_DSS_RESULT__NUM_REQUESTED_SPADS_HI 0x0F8E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_DSS_RESULT__NUM_REQUESTED_SPADS_LO 0x0F8F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MM_RESULT__INNER_INTERSECTION_RATE 0x0F92
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['patch_results', 'mm_results']

  fields: \n
    - [15:0] = mm_result__inner_intersection_rate
*/
#define VL53L1_MM_RESULT__INNER_INTERSECTION_RATE_HI 0x0F92
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MM_RESULT__INNER_INTERSECTION_RATE_LO 0x0F93
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MM_RESULT__OUTER_COMPLEMENT_RATE 0x0F94
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['patch_results', 'mm_results']

  fields: \n
    - [15:0] = mm_result__outer_complement_rate
*/
#define VL53L1_MM_RESULT__OUTER_COMPLEMENT_RATE_HI 0x0F94
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MM_RESULT__OUTER_COMPLEMENT_RATE_LO 0x0F95
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MM_RESULT__TOTAL_OFFSET 0x0F96
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['patch_results', 'mm_results']

  fields: \n
    - [15:0] = mm_result__total_offset
*/
#define VL53L1_MM_RESULT__TOTAL_OFFSET_HI 0x0F96
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_MM_RESULT__TOTAL_OFFSET_LO 0x0F97
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_CALC__XTALK_FOR_ENABLED_SPADS 0x0F98
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 23
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['patch_results', 'xtalk_calc']

  fields: \n
    - [23:0] = xtalk_calc__xtalk_for_enabled_spads (fixed point 11.13)
*/
#define VL53L1_XTALK_CALC__XTALK_FOR_ENABLED_SPADS_3 0x0F98
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_CALC__XTALK_FOR_ENABLED_SPADS_2 0x0F99
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_CALC__XTALK_FOR_ENABLED_SPADS_1 0x0F9A
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_CALC__XTALK_FOR_ENABLED_SPADS_0 0x0F9B
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS 0x0F9C
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 23
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['patch_results', 'xtalk_results']

  fields: \n
    - [23:0] = xtalk_result__avg_xtalk_user_roi_kcps (fixed point 11.13)
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS_3 0x0F9C
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS_2 0x0F9D
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS_1 0x0F9E
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS_0 0x0F9F
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS 0x0FA0
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 23
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['patch_results', 'xtalk_results']

  fields: \n
    - [23:0] = xtalk_result__avg_xtalk_mm_inner_roi_kcps (fixed point 11.13)
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS_3 0x0FA0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS_2 0x0FA1
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS_1 0x0FA2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS_0 0x0FA3
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS 0x0FA4
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 23
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['patch_results', 'xtalk_results']

  fields: \n
    - [23:0] = xtalk_result__avg_xtalk_mm_outer_roi_kcps (fixed point 11.13)
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS_3 0x0FA4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS_2 0x0FA5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS_1 0x0FA6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS_0 0x0FA7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGE_RESULT__ACCUM_PHASE 0x0FA8
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['patch_results', 'range_results']

  fields: \n
    - [31:0] = range_result__accum_phase
*/
#define VL53L1_RANGE_RESULT__ACCUM_PHASE_3 0x0FA8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGE_RESULT__ACCUM_PHASE_2 0x0FA9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGE_RESULT__ACCUM_PHASE_1 0x0FAA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGE_RESULT__ACCUM_PHASE_0 0x0FAB
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGE_RESULT__OFFSET_CORRECTED_RANGE 0x0FAC
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['patch_results', 'range_results']

  fields: \n
    - [15:0] = range_result__offset_corrected_range
*/
#define VL53L1_RANGE_RESULT__OFFSET_CORRECTED_RANGE_HI 0x0FAC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_RANGE_RESULT__OFFSET_CORRECTED_RANGE_LO 0x0FAD
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_PHASECAL_RESULT__VCSEL_START 0x0FAE
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['shadow_system_results', 'histogram_results']

  fields: \n
    - [7:0] = shadow_phasecal_result__vcsel_start
*/
#define VL53L1_SHADOW_RESULT__INTERRUPT_STATUS 0x0FB0
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  5
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [2:0] = shadow_int_status
    - [4:3] = shadow_int_error_status
    -   [5] = shadow_gph_id_gpio_status
*/
#define VL53L1_SHADOW_RESULT__RANGE_STATUS 0x0FB1
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [4:0] = shadow_range_status
    -   [5] = shadow_max_threshold_hit
    -   [6] = shadow_min_threshold_hit
    -   [7] = shadow_gph_id_range_status
*/
#define VL53L1_SHADOW_RESULT__REPORT_STATUS 0x0FB2
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  3
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [3:0] = shadow_report_status
*/
#define VL53L1_SHADOW_RESULT__STREAM_COUNT 0x0FB3
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [7:0] = shadow_result__stream_count
*/
#define VL53L1_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0 0x0FB4
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__dss_actual_effective_spads_sd0 (fixed point 8.8)
*/
#define VL53L1_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x0FB4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x0FB5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0 0x0FB6
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__peak_signal_count_rate_mcps_sd0 (fixed point 9.7)
*/
#define VL53L1_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_HI 0x0FB6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_LO 0x0FB7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0 0x0FB8
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__ambient_count_rate_mcps_sd0 (fixed point 9.7)
*/
#define VL53L1_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0_HI 0x0FB8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0_LO 0x0FB9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__SIGMA_SD0 0x0FBA
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__sigma_sd0 (fixed point 14.2)
*/
#define VL53L1_SHADOW_RESULT__SIGMA_SD0_HI 0x0FBA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__SIGMA_SD0_LO 0x0FBB
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__PHASE_SD0 0x0FBC
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__phase_sd0 (fixed point 5.11)
*/
#define VL53L1_SHADOW_RESULT__PHASE_SD0_HI 0x0FBC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__PHASE_SD0_LO 0x0FBD
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0 0x0FBE
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__final_crosstalk_corrected_range_mm_sd0
*/
#define VL53L1_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_HI 0x0FBE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_LO 0x0FBF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0 0x0FC0
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__peak_signal_count_rate_crosstalk_corrected_mcps_sd0 (fixed point 9.7)
*/
#define VL53L1_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_HI 0x0FC0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_LO 0x0FC1
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0 0x0FC2
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__mm_inner_actual_effective_spads_sd0 (fixed point 8.8)
*/
#define VL53L1_SHADOW_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x0FC2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x0FC3
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0 0x0FC4
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__mm_outer_actual_effective_spads_sd0 (fixed point 8.8)
*/
#define VL53L1_SHADOW_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x0FC4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x0FC5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0 0x0FC6
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__avg_signal_count_rate_mcps_sd0 (fixed point 9.7)
*/
#define VL53L1_SHADOW_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0_HI 0x0FC6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0_LO 0x0FC7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1 0x0FC8
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__dss_actual_effective_spads_sd1 (fixed point 8.8)
*/
#define VL53L1_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1_HI 0x0FC8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1_LO 0x0FC9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1 0x0FCA
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__peak_signal_count_rate_mcps_sd1 (fixed point 9.7)
*/
#define VL53L1_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_HI 0x0FCA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_LO 0x0FCB
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1 0x0FCC
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__ambient_count_rate_mcps_sd1 (fixed point 9.7)
*/
#define VL53L1_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1_HI 0x0FCC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1_LO 0x0FCD
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__SIGMA_SD1 0x0FCE
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__sigma_sd1 (fixed point 14.2)
*/
#define VL53L1_SHADOW_RESULT__SIGMA_SD1_HI 0x0FCE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__SIGMA_SD1_LO 0x0FCF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__PHASE_SD1 0x0FD0
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__phase_sd1 (fixed point 5.11)
*/
#define VL53L1_SHADOW_RESULT__PHASE_SD1_HI 0x0FD0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__PHASE_SD1_LO 0x0FD1
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1 0x0FD2
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__final_crosstalk_corrected_range_mm_sd1
*/
#define VL53L1_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_HI 0x0FD2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_LO 0x0FD3
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__SPARE_0_SD1 0x0FD4
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__spare_0_sd1
*/
#define VL53L1_SHADOW_RESULT__SPARE_0_SD1_HI 0x0FD4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__SPARE_0_SD1_LO 0x0FD5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__SPARE_1_SD1 0x0FD6
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__spare_1_sd1
*/
#define VL53L1_SHADOW_RESULT__SPARE_1_SD1_HI 0x0FD6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__SPARE_1_SD1_LO 0x0FD7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__SPARE_2_SD1 0x0FD8
/*!<
  type:     uint16_t \n
  default:  0x0000 \n
  info: \n
    - msb = 15
    - lsb =  0
    - i2c_size =  2

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [15:0] = shadow_result__spare_2_sd1
*/
#define VL53L1_SHADOW_RESULT__SPARE_2_SD1_HI 0x0FD8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__SPARE_2_SD1_LO 0x0FD9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT__SPARE_3_SD1 0x0FDA
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [7:0] = shadow_result__spare_3_sd1
*/
#define VL53L1_SHADOW_RESULT__THRESH_INFO 0x0FDB
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['shadow_system_results', 'results']

  fields: \n
    - [3:0] = shadow_result__distance_int_info
    - [7:4] = shadow_result__rate_int_info
*/
#define VL53L1_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0 0x0FDC
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = shadow_result_core__ambient_window_events_sd0
*/
#define VL53L1_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_3 0x0FDC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_2 0x0FDD
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_1 0x0FDE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_0 0x0FDF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0 0x0FE0
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['shadow_core_results', 'ranging_core_results']

