LIKAIMO/STM8_VL53L1X/Bsp/vl53l1x_reg.h
  fields: \n
    - [31:0] = shadow_result_core__ranging_total_events_sd0
*/
#define VL53L1_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_3 0x0FE0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_2 0x0FE1
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_1 0x0FE2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_0 0x0FE3
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0 0x0FE4
/*!<
  type:     int32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = shadow_result_core__signal_total_events_sd0
*/
#define VL53L1_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_3 0x0FE4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_2 0x0FE5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_1 0x0FE6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_0 0x0FE7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0 0x0FE8
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = shadow_result_core__total_periods_elapsed_sd0
*/
#define VL53L1_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_3 0x0FE8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_2 0x0FE9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_1 0x0FEA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_0 0x0FEB
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1 0x0FEC
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = shadow_result_core__ambient_window_events_sd1
*/
#define VL53L1_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_3 0x0FEC
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_2 0x0FED
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_1 0x0FEE
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_0 0x0FEF
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1 0x0FF0
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = shadow_result_core__ranging_total_events_sd1
*/
#define VL53L1_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_3 0x0FF0
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_2 0x0FF1
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_1 0x0FF2
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_0 0x0FF3
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1 0x0FF4
/*!<
  type:     int32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = shadow_result_core__signal_total_events_sd1
*/
#define VL53L1_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_3 0x0FF4
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_2 0x0FF5
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_1 0x0FF6
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_0 0x0FF7
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1 0x0FF8
/*!<
  type:     uint32_t \n
  default:  0x00000000 \n
  info: \n
    - msb = 31
    - lsb =  0
    - i2c_size =  4

  groups: \n
    ['shadow_core_results', 'ranging_core_results']

  fields: \n
    - [31:0] = shadow_result_core__total_periods_elapsed_sd1
*/
#define VL53L1_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_3 0x0FF8
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_2 0x0FF9
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_1 0x0FFA
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_0 0x0FFB
/*!<
  info: \n
    - msb =  0
    - lsb =  0
    - i2c_size =  1
*/
#define VL53L1_SHADOW_RESULT_CORE__SPARE_0 0x0FFC
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['shadow_core_results', 'ranging_core_results']

  fields: \n
    - [7:0] = shadow_result_core__spare_0
*/
#define VL53L1_SHADOW_PHASECAL_RESULT__REFERENCE_PHASE_HI 0x0FFE
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['shadow_system_results', 'histogram_results']

  fields: \n
    - [7:0] = shadow_phasecal_result__reference_phase_hi
*/
#define VL53L1_SHADOW_PHASECAL_RESULT__REFERENCE_PHASE_LO 0x0FFF
/*!<
  type:     uint8_t \n
  default:  0x00 \n
  info: \n
    - msb =  7
    - lsb =  0
    - i2c_size =  1

  groups: \n
    ['shadow_system_results', 'histogram_results']

  fields: \n
    - [7:0] = shadow_phasecal_result__reference_phase_lo
*/
#endif
